spec/support/cassettes/opal_modern_pay_failed_create.yml

---
http_interactions:
- request:
    method: post
    uri: http://test.qt.sealink.com.au:8080/api/checkouts.json
    body:
      encoding: UTF-8
      string: booking_id=5&payment[payment_type_id]=10&payment[amount_in_cents]=10&payment[uid]=modern-opal-failed-uid&payment[comment]=Test%20Opal%20Payment&access_key=<QT_KEY>
    headers:
      Content-Length:
      - '0'
  response:
    status:
      code: 200
      message: 'OK '
    headers:
      P3p:
      - CP="IDC DSP CAO COR ADM DEVi TAIi PSA PSD IVAi IVDi CONi HIS OUR IND CNT"
      Content-Type:
      - application/json; charset=utf-8
      Etag:
      - W/"82f4920f9d1df287070e5615a996b73c"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 271edf7c-a6a9-47dc-b7c8-6e39149ea472
      X-Runtime:
      - '0.173347'
      Date:
      - Fri, 01 Jan 2016 02:38:36 GMT
      X-Rack-Cache:
      - invalidate, pass
      Vary:
      - Origin
      X-Content-Type-Options:
      - nosniff
      X-Download-Options:
      - noopen
      X-Frame-Options:
      - sameorigin
      X-Permitted-Cross-Domain-Policies:
      - none
      X-Xss-Protection:
      - 1; mode=block
      Server:
      - WEBrick/1.3.1 (Ruby/2.2.5/2016-04-26)
      Content-Length:
      - '60'
      Connection:
      - Keep-Alive
      Set-Cookie:
      - _session_id=UzdYbXEzaVpWL3l2VDI0ejVaYjZybjJ1OUw4cUVzUkdIMWxQTVF2M3dJaFdnTmhsZGUwcTliaTQxMnFKVUtaM3VmeUJSeGhZSlJyNGJkRXVoWVVBQW9BS2h3a2dDTUhrU3p1Tkh4NXRiRFE9LS1PQ2d6aVBEdW9saHlEakpiSzFtdWZBPT0%3D--8ab1ec3bc30d4fe8e3ceefeaea8b7a23aac9408f;
        path=/; HttpOnly
    body:
      encoding: UTF-8
      string: '{"checkout_id":"modern-opal-failed-uid","completable":false}'
    http_version: 
  recorded_at: Tue, 20 Mar 2018 04:31:58 GMT
recorded_with: VCR 4.0.0
