spec/support/cassettes/opal_modern_pay_successful_response.yml

---
http_interactions:
- request:
    method: post
    uri: http://test.qt.sealink.com.au:8080/api/checkouts.json
    body:
      encoding: UTF-8
      string: booking_id=6&payment[payment_type_id]=10&payment[amount_in_cents]=10&payment[uid]=modern-opal-uid&payment[comment]=Test%20Opal%20Payment&access_key=<QT_KEY>
    headers:
      Content-Length:
      - '0'
  response:
    status:
      code: 200
      message: 'OK '
    headers:
      P3p:
      - CP="IDC DSP CAO COR ADM DEVi TAIi PSA PSD IVAi IVDi CONi HIS OUR IND CNT"
      Content-Type:
      - application/json; charset=utf-8
      Etag:
      - W/"3a5d8871c85df7675b823e4ae118f2dc"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - fd232fcc-df8d-4b34-b837-a96173d01547
      X-Runtime:
      - '0.107059'
      Date:
      - Fri, 01 Jan 2016 02:38:36 GMT
      X-Rack-Cache:
      - invalidate, pass
      Vary:
      - Origin
      X-Content-Type-Options:
      - nosniff
      X-Download-Options:
      - noopen
      X-Frame-Options:
      - sameorigin
      X-Permitted-Cross-Domain-Policies:
      - none
      X-Xss-Protection:
      - 1; mode=block
      Server:
      - WEBrick/1.3.1 (Ruby/2.2.5/2016-04-26)
      Content-Length:
      - '53'
      Connection:
      - Keep-Alive
      Set-Cookie:
      - _session_id=a0JJYnl5Y2ozMlBBTlBPSUhNSnJueUFtOWRqSlNJRkVGaDNkZ0REQUtPQ3ZmYVlTU0wybHY1aDNzWlQySzAxYkJYYXdIVHcvWnlkMU9LcHd4SlBqZDQrWXFyVmMxdlhnTlFwbVIrUUkrdlk9LS00WVdCbFZnNURWWmJNUU5maTY5ei93PT0%3D--a5469f29407194fca0c4d9c1953737e09be93914;
        path=/; HttpOnly
    body:
      encoding: UTF-8
      string: '{"checkout_id":"modern-opal-uid","completable":false}'
    http_version: 
  recorded_at: Tue, 20 Mar 2018 04:31:59 GMT
recorded_with: VCR 4.0.0
